---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
source: html/039ef5a5-ad4d-0a0a-5428-b5d0f618cb7b.htm
---
# EnergyAnalysisConstruction Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.